# PlanTopologies Property

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Document..::..PlanTopologies Property
Document Class See Also
---
Gets the PlanTopologies of the current project.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PlanTopologies | Get the PlanTopologies of the current project in the last phase. |
| [PlanTopologies[([( Phase])]) ](6cead23c-595a-8f54-8692-aa9daad9fb8d.md "PlanTopologies Property \(Phase\)") | Gets the PlanTopologies of the current project in a given phase. |

# See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace